app/Validation/Userrules.php

SELECT *
FROM `usuarios`
WHERE `identificador` = '1000'
 LIMIT 1
---
    public function validateUser(string $str, string $fields, array $data) {
        $model = new UsuarioModel();

        $user = $model->where('identificador', $data['identificador'])->first();