app/Controllers/Admin/AdminController.php

    public function index()
    {
        $session = session();
        if ($session->get('isLoggedIn') != TRUE || $session->get('perfil') != '1') {
            $session->destroy();
            return redirect('/');
        }
        $usuarioModel = model ('UsuarioModel');
        $usuarios = $usuarioModel->orderBy('id', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id` DESC