app/Controllers/Admin/CursosController.php

SELECT *
FROM `curso`
WHERE `curso`.`deleted_at` IS NULL
---
    public function cursosInicio()
    {
        $model = model('CursosInicioModel');
        $data['cursos']=$model->findAll();

SELECT *
FROM `usuarios`
WHERE `perfil` = 3
OR `perfil` = 4
SELECT *
FROM `infoUsuario`
SELECT *
FROM `categoria`
---
    public function agregar()
    {
        $usersModel = model('UsersModel');
        $infoModel = model('InfoModel');
        $categoriasModel = model('CategoriaModel');
        $instructores = $usersModel->where('perfil', 3)->orWhere('perfil', 4)->findAll();
        $infoUsuario = $infoModel->findAll();

        $data = [
            'categorias' => $categoriasModel->findAll(),
            'instructores' => $instructores,
            'infoUsuario' => $infoUsuario
        ];

SELECT *
FROM `tema`
WHERE `idCurso` = '80'
SELECT *
FROM `usuarios`
WHERE `perfil` = 3
OR `perfil` = 4
SELECT *
FROM `infoUsuario`
SELECT *
FROM `categoria`
SELECT *
FROM `curso`
WHERE `curso`.`idCurso` = '80'
---
    public function editar($idCurso)
    {
        $usersModel = model('UsersModel');
        $infoModel = model('InfoModel');
        $categoriasModel = model('CategoriaModel');
        $temaModel = new TemaModel();
        $temas = $temaModel->where('idCurso',$idCurso)->findAll();
        $instructores = $usersModel->where('perfil',3)->orWhere('perfil',4)->findAll();
        $infoUsuario = $infoModel->findAll();
        $cursosInicioModel = model('CursosInicioModel');

        $data=[
            'categorias' => $categoriasModel->findAll(),
            'instructores' => $instructores,
            'infoUsuario' => $infoUsuario,
            'temas'=> $temas,
            'curso' => $cursosInicioModel->find($idCurso)
        ];

UPDATE `curso` SET `instructor` = '28', `nombre` = 'Curso de Administrativo 2', `duracion` = '11w', `descripcion` = 'Curso', `estatus` = 'Activo', `fechaInicio` = '2024-05-07', `fechaFin` = '2024-06-03', `objetivo` = 'dfgsdf', `ilustracion` = 'https://concepto.de/wp-content/uploads/2018/04/base-de-datos-min-e1523470739502.jpg', `idCategoria` = '316'
WHERE `curso`.`idCurso` IN ('82')
---
    public function update (){

        $cursosInicioModel = model('CursosInicioModel');

        $data = [
            "instructor" => $_POST['instructor'],
            "nombre" => $_POST['nombre'],
            "duracion" => $_POST['duracion'],
            "descripcion" => $_POST['descripcion'],
            "estatus" => $_POST['estatus'],
            "fechaInicio" => $_POST['fechaInicio'],
            "fechaFin" => $_POST['fechaFin'],
            "objetivo" => $_POST['objetivo'],
            "ilustracion" => $_POST['ilustracion'],
            "idCategoria" => $_POST['idCategoria']
        ];

        $cursosInicioModel->update($_POST['idCurso'],$data);

SELECT *
FROM `subtema`
WHERE `subtema`.`idSubtema` = '6'
---
    public function mostrarSubtema ($idSubtema) {
        $subtemasModel = new SubtemaModel();
        $subtema = $subtemasModel->find($idSubtema);