app/Controllers/Admin/CursosController.php

INSERT INTO `curso` (`instructor`, `nombre`, `descripcion`, `fechaInicio`, `fechaFin`, `objetivo`, `duracion`, `estatus`, `ilustracion`, `idCategoria`) VALUES ('6', 'Prueba', 'Prueba', '2024-05-16', '2024-05-31', 'Prueba', '1w', 'Activo', 'https://bit.ly/4bD5zwJ', 3)
---
    public function insert()
    {
        $cursosInicioModel = model('CursosInicioModel');
        $db = \Config\Database::connect();

        $data = [
            "instructor" => $_POST['instructor'],
            "nombre" => $_POST['nombre'],
            "duracion" => $_POST['duracion'],
            "estatus" => $_POST['estatus']
        ];
        $cursosInicioModel->insert($data, false);