app/Controllers/Admin/PerfilController.php

SELECT *
FROM `usuarios`
WHERE `usuarios`.`id` = '4'
SELECT *
FROM `infousuario`
WHERE `id_Usuario` = '4'
 LIMIT 1
---
    public function index()
    {
        $session = session();
        if ($session->get('isLoggedIn') != TRUE || $session->get('perfil') != '1') {
            $session->destroy();
            return redirect('/');
        }
        $usuariosModel = model('UsuarioModel');
        $infoUsuarioModel = model('InfoModel');

        $usuario = $usuariosModel->find($session->get('id'));
        $infoUsuario = $infoUsuarioModel->where('id_Usuario', $session->get('id'))->first();

UPDATE `usuarios` SET `identificador` = '1001', `email` = 'estudiante1001@mail.com', `updated_at` = '2024-05-11 06:26:03'
WHERE `usuarios`.`id` IN ('4')
UPDATE `infousuario` SET `nombre` = 'MOISES', `apellidoPaterno` = 'RAMON', `apellidoMaterno` = 'ESTEBAN', `telefono` = '2312323725', `sede` = 'Teteles', `updated_at` = '2024-05-11 06:26:03'
WHERE `infousuario`.`id` IN ('126')
---
        ];

        $usersModel->update(['id_Usuario' => session('id')], $userData);
        $infoModel->update($infoUsuario->id, $infoData);