app/Controllers/Admin/ReportesController.php

SELECT *
FROM `infoUsuario`
WHERE `id_Usuario` = '23'
---
    public function docentes()
    {
        $session = session();
        if ($session->get('isLoggedIn') != TRUE || $session->get('perfil') != '1') {
            $session->destroy();
            return redirect('/');
        }
        $usersModel = model('UsersModel');
        $usuarios = $usersModel->whereIn('perfil', [3, 4])->findAll();

        $InfoModel = model('InfoModel');
        $informacion = [];

        foreach ($usuarios as $usuario) {
            $infoUsuario = $InfoModel->where('id_Usuario', $usuario->id)->findAll();