app/Controllers/Admin/UsuarioController.php

    public function index()
    {
        $session = session();
        if ($session->get('isLoggedIn') != TRUE || $session->get('perfil') != '1') {
            $session->destroy();
            return redirect('/');
        }
        $usersModel = model('UsersModel');
        $usuarios = $usersModel->where('perfil', 2)->findAll();

        $InfoModel = model('InfoModel');
        $informacion = [];

        foreach ($usuarios as $usuario) {
            // Modificar la fecha para obtener solo el año
            $usuario->created_at = date('Y', strtotime($usuario->created_at));
            $usuario->status = ($usuario->status == 1) ? 'Activo' : 'Inactivo';
            $infoUsuario = $InfoModel->where('id_Usuario', $usuario->id)->findAll();
---
SELECT *
FROM `infoUsuario`
WHERE `id_Usuario` = '23'