app/Controllers/AdministrativoSG/MisCursosController.php

    public function misCursos(){
        $cursoUsuarioModel = new CursoUsuarioModel();
        $data = [
            'cursos' => $cursoUsuarioModel->where('idUsuario',session()->get('id'))->findAll()
        ];
---
SELECT *
FROM `curso_usuario`
WHERE `idUsuario` = '28'