app/Controllers/Estudiante/CursosController.php

SELECT *
FROM `curso`
WHERE `visibilidad` = 1
---
    public function cursosInicio()
    {
        $cursoUsuarioModel = new CursoUsuarioModel();
        $cursosUsuario = $cursoUsuarioModel->where('idUsuario', session()->get('id'))->findAll();
        $model = model('CursosInicioModel');
        if (isset($_POST['search'])) {
            $search = $_POST['search'];
            $data['cursos'] = $model->where('visibilidad',1)->like('nombre','%'.$search.'%')->findAll();
        } else {
            $data['cursos'] = $model->where('visibilidad', 1)->findAll();