app/Controllers/Docente/CursosController.php

    public function insert()
    {
        $cursosInicioModel = model('CursosInicioModel');

        $data = [
            "instructor" => $_POST['instructor'],
            "nombre" => $_POST['nombre'],
            "descripcion" => $_POST['descripcion'],
            "fechaInicio" => $_POST['fechaInicio'],
            "fechaFin" => $_POST['fechaFin'],
            "objetivo" => $_POST['objetivo'],
            "duracion" => $_POST['duracion'],
            "estatus" => $_POST['estatus'],
            "ilustracion" => $_POST['ilustracion'],
            "idCategoria" => 3
        ];

        $cursosInicioModel->insert($data, true);
---
INSERT INTO `curso` (`instructor`, `nombre`, `descripcion`, `fechaInicio`, `fechaFin`, `objetivo`, `duracion`, `estatus`, `ilustracion`, `idCategoria`) VALUES ('29', 'Curso del Docente', 'a\'sldkmv', '2024-05-22', '2024-06-08', 'Objetivo de prueba', '1w', 'Activo', 'https://bit.ly/4bjTn3Z', 3)

    public function editar($idCurso)
    {
        $usersModel = model('UsersModel');
        $infoModel = model('InfoModel');
        $categoriasModel = model('CategoriaModel');
        $temaModel = new TemaModel();
        $temas = $temaModel->where('idCurso',$idCurso)->findAll();
        $instructores = $usersModel->where('perfil',3)->orWhere('perfil',4)->findAll();
        $infoUsuario = $infoModel->findAll();
        $cursosInicioModel = model('CursosInicioModel');

        $data=[
            'categorias' => $categoriasModel->findAll(),
            'instructores' => $instructores,
            'infoUsuario' => $infoUsuario,
            'temas'=> $temas,
            'curso' => $cursosInicioModel->find($idCurso)
        ];
---
SELECT *
FROM `tema`
WHERE `idCurso` = '81'
SELECT *
FROM `usuarios`
WHERE `perfil` = 3
OR `perfil` = 4
SELECT *
FROM `infoUsuario`
SELECT *
FROM `categoria`
SELECT *
FROM `curso`
WHERE `curso`.`deleted_at` IS NULL
AND `curso`.`idCurso` = '81'