app/Controllers/Docente/MisCursosController.php

SELECT *
FROM `curso`
WHERE `curso`.`idCurso` = '90'
SELECT *
FROM `tema`
WHERE `idCurso` = '90'
---
    public function verCurso($idCurso)
    {
        $temaModel = new TemaModel();
        $cursoModel = new CursosInicioModel();

        $curso = $cursoModel->find($idCurso);

        $temas = $temaModel->where('idCurso', $idCurso)->findAll();

SELECT *
FROM `tema`
WHERE `tema`.`idTema` = '26'
SELECT *
FROM `subtema`
WHERE `idTema` = '26'
---
    public function verTema($idTema)
    {
        $temaModel = new TemaModel();
        $subtemaModel = new SubtemaModel();

        $tema = $temaModel->find($idTema);

        if (!$tema) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException("No se encontró el tema con ID: " . $idTema);
        }

        $subtemas = $subtemaModel->where('idTema', $idTema)->findAll();

SELECT *
FROM `subtema`
WHERE `subtema`.`idSubtema` = '9'
---
    public function verSubtema($idSubtema)
    {
        $subtemaModel = new SubtemaModel();

        $subtema = $subtemaModel->find($idSubtema);