app/Controllers/RegistroController.php

INSERT INTO `usuarios` (`perfil`, `identificador`, `email`, `password`, `status`, `created_at`, `updated_at`) VALUES (1, '8421677', 'masemmmmoyv1@gmail.com', '$2y$10$XqzxXap8SDdzaNjaYTPCdu3/gDADMrC3xwna3a8gEPlME1H/0/H4S', 1, '2024-05-03 02:39:32', '2024-05-03 02:39:32')
---
    public function create()
    {
        $data = [
            'perfil'            => 2,
            'identificador'     => $this->request->getVar('identificador'),
            'email'             => $this->request->getVar('email'),
            'password'          => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'status'            => 1,
        ];

        $rules = [
            'identificador' => 'required|is_unique[usuarios.identificador]',
            'password'      => 'required|min_length[8]|max_length[30]',
            'email'         => 'required|valid_email|is_unique[usuarios.email]'
        ];

        if (!$this->validate($rules)) {
            return redirect()->to('registro')->withInput()->with('errors', $this->validator->getErrors());
        }

        $this->usuarioModel->insert($data);