app/Controllers/UserController.php

SELECT *
FROM `usuarios`
WHERE `identificador` = '1000'
 LIMIT 1
---
    public function login()
    {

        if ($this->request->getMethod() == 'post') {

            $rules = [
                'identificador' => 'required|min_length[1]|max_length[20]',
                'password' => 'required|min_length[8]|max_length[255]|validateUser[identificador,password]',
            ];

            $errors = [
                'password' => [
                    'validateUser' => "Nombre de usuario o contraseña incorrecta",
                ],
            ];

            if (!$this->validate($rules, $errors)) {
                return view('login', [
                    "validation" => $this->validator,
                ]);
            } else {
                $model = new UsuarioModel();

                $user = $model->where('identificador', $this->request->getVar('identificador'))->first();